


Audio Video Transport                                           A. Leung
Internet-Draft                                                S. Futemma
Intended status: Standards Track                              E. Itakura
Expires: October 26, 2008                                           Sony
                                                            Apr 24, 2008


Payload Format for JPEG 2000 Video: Extensions for Scalability and Main
                            Header Recovery
                  draft-ietf-avt-rtp-jpeg2000-beam-10

Status of this Memo

   By submitting this Internet-Draft, each author represents that any
   applicable patent or other IPR claims of which he or she is aware
   have been or will be disclosed, and any of which he or she becomes
   aware will be disclosed, in accordance with Section 6 of BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt.

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   This Internet-Draft will expire on October 26, 2008.

Copyright Notice

   Copyright (C) The IETF Trust (2008).












Leung, et al.           Expires October 26, 2008                [Page 1]

Internet-Draft              JPEG 2000 RTP EX                    Apr 2008


Abstract

   This memo describes extended uses for payload header in RFC document:
   "RTP Payload Format for JPEG 2000 Video Streams."  For better support
   of JPEG 2000 features such as scalability and main header recovery.

   This memo must be accompanied with a complete implementation of "RTP
   Payload Format for JPEG 2000 Video Streams."  That document is a
   complete description of the payload header and signaling, this
   document only describes additional processing for the payload header.
   There is an additional media type and SDP marker signaling for
   implementations of this document.







































Leung, et al.           Expires October 26, 2008                [Page 2]

Internet-Draft              JPEG 2000 RTP EX                    Apr 2008


Table of Contents

   1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  4
     1.1.  Description of the Mechanisms  . . . . . . . . . . . . . .  4
       1.1.1.  Main Header Compensation . . . . . . . . . . . . . . .  4
       1.1.2.  Priority Table . . . . . . . . . . . . . . . . . . . .  4
     1.2.  Motivations for Priority Field coding  . . . . . . . . . .  5
       1.2.1.  Scenario: Just enough resolution . . . . . . . . . . .  5
       1.2.2.  Scenario: Multiple clients, single source  . . . . . .  5
     1.3.  Conventions Used in This Document  . . . . . . . . . . . .  5
   2.  Payload Format Enhanced Processing . . . . . . . . . . . . . .  6
     2.1.  Enhanced Processing Markers  . . . . . . . . . . . . . . .  6
   3.  Priority Mapping Table . . . . . . . . . . . . . . . . . . . .  8
     3.1.  Packet Number Based Ordering . . . . . . . . . . . . . . .  8
     3.2.  Progression Based Ordering . . . . . . . . . . . . . . . .  8
     3.3.  Layer Based Ordering . . . . . . . . . . . . . . . . . . . 10
     3.4.  Resolution Based Ordering  . . . . . . . . . . . . . . . . 10
     3.5.  Component Based Ordering . . . . . . . . . . . . . . . . . 10
   4.  JPEG 2000 Main Header Compensation Scheme  . . . . . . . . . . 12
     4.1.  Sender Processing  . . . . . . . . . . . . . . . . . . . . 12
     4.2.  Receiver Processing  . . . . . . . . . . . . . . . . . . . 12
   5.  Media Type Registration  . . . . . . . . . . . . . . . . . . . 14
   6.  SDP Parameters . . . . . . . . . . . . . . . . . . . . . . . . 15
     6.1.  Mapping of the optional parameters to SDP  . . . . . . . . 15
     6.2.  Usage with the SDP Offer/Answer Model  . . . . . . . . . . 15
       6.2.1.  Examples . . . . . . . . . . . . . . . . . . . . . . . 16
   7.  IANA Consideration . . . . . . . . . . . . . . . . . . . . . . 19
   8.  Security Consideration . . . . . . . . . . . . . . . . . . . . 20
   9.  Congestion Control . . . . . . . . . . . . . . . . . . . . . . 21
   10. Normative References . . . . . . . . . . . . . . . . . . . . . 22
   Appendix A.  Sample Headers in Detail  . . . . . . . . . . . . . . 23
     A.1.  Sample 1: Progressive image with single tile, 3500
           bytes (i.e. thumbnail) . . . . . . . . . . . . . . . . . . 23
     A.2.  Smaple 2: Image with 4 tiles . . . . . . . . . . . . . . . 25
     A.3.  Sample 3: Packing multiple tiles in single payload,
           fragmented header. No header compensation, progressive
           image  . . . . . . . . . . . . . . . . . . . . . . . . . . 26
     A.4.  Sample 4: Interlace image, single tile . . . . . . . . . . 28
   Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . . . 32
   Intellectual Property and Copyright Statements . . . . . . . . . . 33











Leung, et al.           Expires October 26, 2008                [Page 3]

Internet-Draft              JPEG 2000 RTP EX                    Apr 2008


1.  Introduction

   This document is an extension of: "RTP Payload Format for JPEG 2000
   Video Streams" [1].  These are additional mechanisms which can be
   used with certain parts of the header in [1] to support JPEG 2000
   features such as: scalability and a main header compensation method.
   These mechanisms are described in detail in this document.

   These are optional extensions to RFC XXXY [1].which one may use to
   make better use of JPEG 2000 features.  These extensions are not
   required for any implementations of RFC XXXY[1].

1.1.  Description of the Mechanisms

1.1.1.  Main Header Compensation

   JPEG 2000 has a scalable coding scheme which allows for decompressing
   truncated or partial data streams but only when the main header is
   present.  If the header is lost, the data is useless.  With JPEG 2000
   video coding, coding parameters between frames will rarely change and
   previous headers may be used in newly received data which the header
   have been lost.

   Compensation of the main header that has been lost is very simple
   with this procedure.  In the case of JPEG 2000 video, it is very
   common that encode parameters will not vary greatly between
   successive frames.  Even if the RTP packet including the main header
   of a frame has been dropped, decoding may be performed by using the
   main header of a prior frame.

1.1.2.  Priority Table

   JPEG 2000 codestream has rich functionality built into it so decoders
   can easily handle scalable delivery or progressive transmission.
   Progressive transmission allows images to be reconstructed with
   increasing pixel accuracy or spatial resolution.  This feature allows
   the reconstruction of images with different resolutions and pixel
   accuracy, for different target devices.  A single image source can
   provide a codestream that is easily processed for smaller image
   display devices.

   JPEG 2000 packets contain all compressed image data from a specific:
   layer, component, resolution level, and/or precinct.  The order in
   which these JPEG 2000 packets are found in the codestream is called:
   the progression order.  The ordering of the JPEG 2000 packets can
   progress along four axes: layer, component, resolution and precinct
   (or position).




Leung, et al.           Expires October 26, 2008                [Page 4]

Internet-Draft              JPEG 2000 RTP EX                    Apr 2008


   Providing a priority field to indicate the importance of data
   contained in a given RTP packet can aid in usage of JPEG 2000
   progressive and scalable functions.

1.2.  Motivations for Priority Field coding

   JPEG 2000 coding scheme allows one to reorder the codestream in many
   ways.  Even when the coding scheme is determined and arranged by the
   encoder, a decoder can still re-arrange the code stream on the fly to
   suit decode parameters such as: re-arranging from resolution
   progressive to quality progressive.

   Using the priority field coding, the decoder gains insight into the
   codestream without access to the full codestream and exposes features
   of JPEG 2000 to a higher level.

   A few of the scenarios are presented below the authors have thought
   of to utilize this field.  The priority field allows more information
   about the image to be sent without more signaling between sender and
   receivers to leverage JPEG 2000 capabilities.

1.2.1.  Scenario: Just enough resolution

   The scenario is when rapid scene access is more important than higher
   quality.  By using the priority field, the receiver can decode for
   its own quality level.  If the sender cannot determine the receiver's
   resolution, the receiver can select which parts of the codestream to
   decode/load by using the priority field.

1.2.2.  Scenario: Multiple clients, single source

   In a multicast environment, there are clients with better visual
   capability than others (i.e.  TV conference vs. Mobile).  The
   respective clients can use the priority field to determine which
   packets are vital for their own visual presentation.  The sender will
   have to do work on the priority field to optimally serve all the
   clients while only managing a single visual stream.

1.3.  Conventions Used in This Document

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC2119. [2].

   RFC-Editor Note: The RFC Editor is requested to replace all
   occurences of RFC XXXY with the RFC number
   draft-ietf-avt-rtp-jpeg2000 receives.  At that time, please remove
   this note.



Leung, et al.           Expires October 26, 2008                [Page 5]

Internet-Draft              JPEG 2000 RTP EX                    Apr 2008


2.  Payload Format Enhanced Processing

2.1.  Enhanced Processing Markers

   This section of the document describes additional usage in the values
   of mh_id and priority fields and interpretation which differ from RFC
   XXXY [1].  Implementions of this document should follow RFC XXXY [1]
   first then add additional header processing as described in this
   document.  Implementations following this document are expected to
   interoperate with implementations of [1] and this document as well.

   The RTP payload header format for JPEG 2000 video stream is as
   follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |tp |MHF|mh_id|T|     priority  |           tile number         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |reserved       |             fragment offset                   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+




             Figure 1: RTP payload header format for JPEG 2000

   mh_id (Main Header Identification) : 3 bits

      Main header identification value.  This is used for JPEG 2000 main
      header recovery.

      The initial value of mh_id MUST be 1 at the beginning of the
      session.

      The same mh_id value is used as long as the coding parameters
      described in the main header remains unchanged between frames.

      The mh_id value MUST be incremented by 1 every time a new main
      header is transmitted.  Once the mh_id value becomes greater than
      7, it SHOULD roll over to 1.

      When mh_id is 0, it has special usage for the receiver.  This
      special usage is described in Section 4.2 of this document.

      Senders should follow Section 4.1 of this document for proper
      mh_id assignment and usage.




Leung, et al.           Expires October 26, 2008                [Page 6]

Internet-Draft              JPEG 2000 RTP EX                    Apr 2008


   priority : 8 bits

      The priority field indicates the importance of the JPEG 2000
      packet included in the payload.  Typically, a higher priority is
      set in the packets containing JPEG 2000 packets containing the
      lower sub-bands.

      Special values of priority:

      0: This is reserved for payload which contain a header (main or
         tile part header.)  This is considered the most important.

      1 to 255:  These values decrease in importance as the values
         increase. (i.e. 1 is more important than 2, etc.)  Applying
         priority values should correlate directly to JPEG 2000
         codestream in importance.

      The lower the priority value is the higher the importance.  A
      priority value of 0 is the highest importance and 255 is the
      lowest importance.  We define the priority value 0 as a special
      priority value for the headers (the main header or tile-part
      header).  If any headers (the main header or tile-part header) are
      packed into the RTP payload, the sender MUST set the priority
      value to 0.

      Assignment of the values are described in Section 3

























Leung, et al.           Expires October 26, 2008                [Page 7]

Internet-Draft              JPEG 2000 RTP EX                    Apr 2008


3.  Priority Mapping Table

   For the progression order, the priority value for each JPEG 2000
   packet is given by the priority mapping table.

   This document specify several commonly-used priority mapping tables,
   pre-defined priority mapping tables: packet number based (default),
   progression-based, layer-based, resolution-based, position-based, and
   component-based.

   Packet number priority mapping is REQUIRED to be supported by clients
   implementing this specification.  Other priority mapping tables
   (progression, layer, resolution, and component based) are OPTIONAL to
   implementations of this specification.

   Rules that all implementations of this specification MUST follow in
   all priority modes:

   o  When there is a header in the packet with a JPEG 2000 packet, the
      sender MUST set the payload packet priority value to 0.

   o  When there are multiple JPEG 2000 packets in the same RTP payload
      packet, the sender MUST set the payload packet priority value to
      the lowest JPEG 2000 packet. (i.e. if JPEG 2000 packets with
      priority: 5,6,7 are packed into a single payload, the priority
      value will be 5.)

3.1.  Packet Number Based Ordering

   Packet number based ordering assigns the payload packet priority
   value from the "JPEG 2000 packet value". (note: JPEG 2000 codestreams
   are stored in units of packets and each packet has a value .)  This
   method is the default method for assigning priority value.  All
   implementations of this specification MUST support this method.

   If the JPEG 2000 codestream packet value is greater than 255, the
   sender MUST set the payload priority value to 255.

3.2.  Progression Based Ordering

   The sender will assign the payload packet priority value only based
   on layer, resolution, and component ordering of the codestream.

   The ordering can assign the different priority values in the same
   layer or the resolution level, which cannot do in the layer based
   ordering or resolution based ordering.

   The difference from the packet number based ordering is that it does



Leung, et al.           Expires October 26, 2008                [Page 8]

Internet-Draft              JPEG 2000 RTP EX                    Apr 2008


   not assign the value in the position level, which saves the priority
   values usage.  The position based priority signaling is not so
   important because a receiver could recognize the position by checking
   the tile number field.  Therefore, the ordering would be useful.

   For example:

   If the codestream is ordered in LRCP (Layer, Resolution, Component,
   Position) with 1 layer, 2 resolutions, 3 components, and 2 positions,
   an example would have packet numbering as so:

      All the packets in:

         layer.........0
         resolution....0
         component.....0
         position......0 or 1

      then the packet priority value : 1

      All the packets in:

         layer.........0
         resolution....0
         component.....1
         position......0 or 1

      then the packet priority value : 2

      All the packets in:

         layer.........0
         resolution....0
         component.....2
         position......0 or 1

      then the packet priority value : 3

      All the packets in:

         layer.........0
         resolution....1
         component.....0
         position......0 or 1

      then the packet priority value : 4





Leung, et al.           Expires October 26, 2008                [Page 9]

Internet-Draft              JPEG 2000 RTP EX                    Apr 2008


      All the packets in:

         layer.........0
         resolution....1
         component.....1
         position......0 or 1

      then the packet priority value : 5

3.3.  Layer Based Ordering

   Layer-based priority mapping table simplifies the default mapping to
   just matching JPEG 2000 packets together from the same layer.

   For example:

      All the packets in layer 0 : packet priority value : 1
      All the packets in layer 1 : packet priority value : 2
      All the packets in layer 2 : packet priority value : 3
      ...
      All the packets in layer n : packet priority value : n+1
      All the packets in layer 255 : packet priority value : 255

3.4.  Resolution Based Ordering

   Resolution-based priority mapping table is similar to the layer based
   order but for JPEG 2000 packets of the same resolution

   For example:

      All the packets in resolution 0 : packet priority value : 1
      All the packets in resolution 1 : packet priority value : 2
      All the packets in resolution 2 : packet priority value : 3
      ...
      All the packets in resolution n : packet priority value : n+1
      All the packets in resolution 255 : packet priority value : 255

3.5.  Component Based Ordering

   Component-based priority mapping table is mapping together JPEG 2000
   components of the same component

   For example:

      All the packets in component 0 : packet priority value : 1
      All the packets in component 1 : packet priority value : 2
      All the packets in component 2 : packet priority value : 3
      ...



Leung, et al.           Expires October 26, 2008               [Page 10]

Internet-Draft              JPEG 2000 RTP EX                    Apr 2008


      All the packets in component n : packet priority value : n+1
      All the packets in component 255 : packet priority value : 255

















































Leung, et al.           Expires October 26, 2008               [Page 11]

Internet-Draft              JPEG 2000 RTP EX                    Apr 2008


4.  JPEG 2000 Main Header Compensation Scheme

   The mh_id field of the payload header is used to indicate whether the
   encoding parameters of the main header are the same as the encoding
   parameters of the previous frame.  The same value is set in mh_id of
   the RTP packet in the same frame.  The mh_id and encode parameters
   are not associated with each other as 1:1 but they are used to
   indicate whether the encode parameters of the previous frame are the
   same or not in the event of a lost header.

   The mh_id field value SHOULD be saved from previous frames to be used
   to recover the current frame's main header.  If the mh_id of the
   current frame has the same value as the mh_id value of the previous
   frame, the previous frame's main header MAY be used to decode the
   current frame, in case of a lost header in the current frame.

   The sender MUST increment mh_id when parameters in the header change
   and send a new main header accordingly.

   The receiver MAY use the mh_id and MAY retain the header for such
   compensation.

4.1.  Sender Processing

   The sender MUST transmit RTP packets with the same mh_id value if the
   encoder parameters of the current frame are the same as the previous
   frame.  The encoding parameters are the fixed information marker
   segment (SIZ marker) and functional marker segments (COD, COC, RGN,
   QCD, QCC, and POC) specified in JPEG 2000 Part 1 Annex A [3].

   An initial value of mh_id MUST be selected randomly between 1 and 7
   for security reasons.

   If the encode parameters changes, the sender transmitting RTP packets
   MUST increment the mh_id value by one, but when mh_id value becomes
   greater than 7, a sender MUST set mh_id value back to 1.

4.2.  Receiver Processing

   When the receiver receives the main header completely, the RTP
   sequence number, the mh_id and main header should be saved.  Only the
   last main header that was received completely SHOULD be saved.  When
   the mh_id value is 0, the receiver SHOULD NOT save the header.

   When the main header is not received, the receiver may compare the
   current payload header's mh_id value with the previous saved mh_id
   value.  If the values match, decoding may be performed by using the
   previously saved main header.



Leung, et al.           Expires October 26, 2008               [Page 12]

Internet-Draft              JPEG 2000 RTP EX                    Apr 2008


   If the mh_id field is set to 0, the receiver MUST NOT save the main
   header and MUST NOT compensate for lost headers.

   If the mh_id value changes, receivers SHOULD save the current header
   and save the new mh_id value.  The old saved header should be deleted
   from storage.













































Leung, et al.           Expires October 26, 2008               [Page 13]

Internet-Draft              JPEG 2000 RTP EX                    Apr 2008


5.  Media Type Registration

   This document extends the associated media type from RFC XXXY[1].
   Here are additional optional parameters.

   Additional optional parameters:

      mhc  : Main Header Compensation. this option is used when sender
         and/or receiver is utilizing the Main Header compensation
         technique as specified in this document.  Acceptable values
         when using the Main Header compensation technique is "1",
         otherwise, it should be "0".

         This is a list of options to be included when the sender or
         receiver is utilizing the Priority Table option as specified in
         this document.

      pt : Priority Table. this option is followed by a comma-separated
         list of predefined priority table definitions to be used by
         sender or receiver.

         The option appearing front most in the option line is the most
         important and next are of decreasing importance.

            Acceptable values:

            progression  : this table follows the progression ordering
               of the codestream.

            layer  : this table follows the layer ordering of the
               codestream.

            resolution  : this table follows the resolution ordering of
               the codestream.

            component  : this table follows the component ordering of
               the codestream.

            default  : this table follows the ordering of the
               codestream.











Leung, et al.           Expires October 26, 2008               [Page 14]

Internet-Draft              JPEG 2000 RTP EX                    Apr 2008


6.  SDP Parameters

6.1.  Mapping of the optional parameters to SDP

   The new optional parameters mhc and pt, if presented, MUST be
   included in the "a=fmtp" line of SDP.  These parameters are expressed
   as a media type string, in the form of a semicolon separated list of
   parameter=value pairs.

6.2.  Usage with the SDP Offer/Answer Model

   In addition to SDP Offer/Answer section in RFC XXXY [1]:

   When offering JPEG 2000 over RTP using SDP in an Offer/Answer model
   [4], the following rules and limitations apply:

   o  All parameters MUST have an acceptable value for that parameter.

   o  All parameters MUST correspond to the parameters of the payload.

   o  If the optional parameter "mhc" is used, it MUST appear in the
      offer with value "1", and if accepted, it SHOULD appear in the
      answer.

   o  If the optional parameter "pt" is used, it MUST appear in the
      offer containing a complete comma-separated list indicating which
      priority table definitions the sender supprots.  If accepted, it
      SHOULD appear in the answer containing a single priority table
      definition selected from the offer.

   o  If the optional parameter "mhc" is used, it MUST appear in the
      offer with value "1", and if accepted, it MUST appear in the
      answer.  If the optional parameter "pt" is used, it MUST appear in
      the offer containing a complete comma-separated list indicating
      which priority table definitions the sender supports.  If
      accepted, it MUST appear in the answer containing a single
      priority table definition selected from the offer.

   o  In a multicast environment:

      *  Senders should send out one option for priority-table-
         definition for everyone in the group.

      *  Even if a single client in the group does not support the
         extensions outlined in this document, senders MAY use these
         mechanisms.  A receiver which doesn't support the mechanisms
         would safely ignore the values.in mh_id and priority field.




Leung, et al.           Expires October 26, 2008               [Page 15]

Internet-Draft              JPEG 2000 RTP EX                    Apr 2008


6.2.1.  Examples

   Offer/Answer example exchanges are provided.

6.2.1.1.  Example 1

   Alice offers Main Header Compensation functionality, YCbCr 422 color
   space, interlace image with 720-pixel width and 480-pixel height and
   several priority-table options (default, progression, layer,
   resolution, component) as below:

      v=0
      o=alice 2890844526 2890844526 IN IP4 host.example
      s=
      c=IN IP4 host.example
      t=0 0
      m=video 49170 RTP/AVP 98
      a=rtpmap:98 jpeg2000/90000
      a=fmtp:98 mhc=1; sampling=YCbCr-4:2:2; interlace=1;
      pt=default,progression,layer,resolution, component;
      width=720;height=480

   Bob accepts Main Header Compensation functionality, YCbCr-4:2:2 color
   space, interlace image, default mapping table and replies:

      v=0
      o=bob 2890844730 2890844731 IN IP4 host.example
      s=
      c=IN IP4 host.example
      t=0 0
      m=video 49920 RTP/AVP 98
      a=rtpmap:98 jpeg2000/90000
      a=fmtp:98 mhc=1; sampling=YCbCr-4:2:2;interlace=1;
      pt=default;width=720;height=480

6.2.1.2.  Example 2

   Alice offers Main Header Compensation, YCbCr 420 color space,
   progressive image with 320-pixel width and 240-pixel height and layer
   priority-table options as below:

      v=0
      o=alice 2890844526 2890844526 IN IP4 host.example
      s=
      c=IN IP4 host.example
      t=0 0
      m=video 49170 RTP/AVP 98
      a=rtpmap:98 jpeg2000/90000



Leung, et al.           Expires October 26, 2008               [Page 16]

Internet-Draft              JPEG 2000 RTP EX                    Apr 2008


      a=fmtp:98 mhc=1; sampling=YCbCr-4:2:0;
      pt=layer;width=320;height=240

   Bob does not accept Main Header Compensation functionality but
   accepts YCbCr-4:2:0 color space,layer based priority mapping and
   replies:

      v=0
      o=bob 2890844730 2890844731 IN IP4 host.example
      s=
      c=IN IP4 host.example
      t=0 0
      m=video 49920 RTP/AVP 98
      a=rtpmap:98 jpeg2000/90000
      a=fmtp:98 mhc=0; sampling=YCbCr-4:2:0;
      pt=layer;width=320;height=240

6.2.1.3.  Example 3

   Alice offers 27 MHz timestamp, Main Header Compensation, YCbCr 420
   color space, progressive image with 320-pixel width and 240-pixel
   height and layer priority-table options as below:

      v=0
      o=alice 2890844526 2890844526 IN IP4 host.example
      s=
      c=IN IP4 host.example
      t=0 0
      m=video 49170 RTP/AVP 98 99
      a=rtpmap:98 jpeg2000/27000000
      a=rtpmap:99 jpeg2000/90000
      a=fmtp:98 mhc=1; sampling=YCbCr-4:2:0;
      pt=layer;width=320;height=240
      a=fmtp:99 mhc=1; sampling=YCbCr-4:2:0;
      pt=layer;width=320;height=240

   Bob can accept payload type with 27 MHz timestamp, and does not
   accept Main Header Compensation functionality but accepts YCbCr-4:2:0
   color space,layer based priority mapping and replies:

      v=0
      o=bob 2890844730 2890844731 IN IP4 host.example
      s=
      c=IN IP4 host.example
      t=0 0
      m=video 49920 RTP/AVP 98
      a=rtpmap:98 jpeg2000/27000000
      a=fmtp:98 mhc=0; sampling=YCbCr-4:2:0;



Leung, et al.           Expires October 26, 2008               [Page 17]

Internet-Draft              JPEG 2000 RTP EX                    Apr 2008


      pt=layer;width=320;height=240


















































Leung, et al.           Expires October 26, 2008               [Page 18]

Internet-Draft              JPEG 2000 RTP EX                    Apr 2008


7.  IANA Consideration

   This document extends the associated media type from XXXY [1].
   Additional parameters are specified in Section 5 of this document.















































Leung, et al.           Expires October 26, 2008               [Page 19]

Internet-Draft              JPEG 2000 RTP EX                    Apr 2008


8.  Security Consideration

   Please refer to section 6 of RFC XXXY [1] for Security Considerations
   regarding this RTP format.  The security issues regarding enhanced
   mechanisms presented in this document are discussed in the section.

   The mh_id field can identify a maximum of 7 different main headers.
   If severe packet loss (either random or intentionally introduced by
   an attacker) causes 6 successive updates to the main header to be
   lost, the decoder will attempt decompression using an incorrect main
   header.  Care should be taken to prevent implementation bugs with
   potential security consequences."







































Leung, et al.           Expires October 26, 2008               [Page 20]

Internet-Draft              JPEG 2000 RTP EX                    Apr 2008


9.  Congestion Control

   Please refer to section 7 of RFC XXXY [1] for Congestion Control
   regarding this RTP format.















































Leung, et al.           Expires October 26, 2008               [Page 21]

Internet-Draft              JPEG 2000 RTP EX                    Apr 2008


10.  Normative References

   [1]  Futemma, "RTP Payload Format for JPEG 2000 Video Streams",
        RFC XXXY, April 2007.

   [2]  Bradner, "Key words for use in RFCs to Indicate Requirement
        Levels", RFC 2119, March 1997.

   [3]  ISO/IEC JTC1/SC29, ISO/IEC 15444-1 | ITU-T Rec. T.800,
        "Information Technology - JPEG 2000 Image Coding System -  Part
        1: Core Coding System", December 2000.

   [4]  Rosenberg and Schulzrinne, "An Offer/Answer Model with Session
        Description Protocol (SDP)", RFC 3264, June 2002.





































Leung, et al.           Expires October 26, 2008               [Page 22]

Internet-Draft              JPEG 2000 RTP EX                    Apr 2008


Appendix A.  Sample Headers in Detail

   The following figures are sample RTP headers demonstrating values
   that should appear in the RTP header.  The packet priority is Packet
   Number Based Priority.

   For reference, the payload header as follows

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |tp |MHF|mh_id|T|     priority  |           tile number         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |reserved       |             fragment offset                   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                     Figure 2: JPEG200 payload header

A.1.  Sample 1: Progressive image with single tile, 3500 bytes (i.e.
      thumbnail)

   First Packet: This packet will have the whole main header. 210 bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | 0 | 3 |  1  |1|       0       |               0               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       0       |                       0                       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF4F FF51 002F 0000                   ....                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                Figure 3: Header Sample 1-1 (First Packet)















Leung, et al.           Expires October 26, 2008               [Page 23]

Internet-Draft              JPEG 2000 RTP EX                    Apr 2008


   Second Packet: This packet will have a tile header and the first tile
   part LLband 1500 bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | 0 | 0 |  1  |0|       1       |               0               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       0       |                      210                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF90 000A 0000 0000 2DB3  0001 FF93   ....                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                Figure 4: Header Sample 1-2 (Second Packet)

   Third Packet: This packet will have the next part in the tile, no
   tile header 1500 bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | 0 | 0 |  1  |0|       2       |               0               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       0       |                     1710                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |E841 4526 4556 9850 C2EA              ....                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                Figure 5: Header Sample 1-3 (Third Packet)

   Fourth Packet: Last packet for the image 290 bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | 0 | 0 |  1  |0|       3       |               0               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       0       |                     3210                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |A55D 8B73 3B25 25C7 B9EB ....                         2FBE B153|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                Figure 6: Header Sample 1-4 (Fourth Packet)





Leung, et al.           Expires October 26, 2008               [Page 24]

Internet-Draft              JPEG 2000 RTP EX                    Apr 2008


A.2.  Smaple 2: Image with 4 tiles

   First Packet: This packet will have the whole main header. 210 bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | 0 | 3 |  1  |1|       0       |               0               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       0       |                       0                       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF4F FF51 002F 0000                   ....                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                Figure 7: Header Sample 2-1 (First Packet)

   Second Packet: This packet will have a first tile part (tile 0) 1400
   bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | 0 | 0 |  1  |0|       1       |               0               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       0       |                      210                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF90 000A 0000 0000 0578  0001 FF93   ....                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                Figure 8: Header Sample 2-2 (Second Packet)

   Third Packet: This packet will have a second tile part (tile 1) 1423
   bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | 0 | 0 |  1  |0|       1       |               1               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       0       |                     1610                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF90 000A 0001 0000 058F 0001 FF93    ....                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                Figure 9: Header Sample 2-3 (Third Packet)



Leung, et al.           Expires October 26, 2008               [Page 25]

Internet-Draft              JPEG 2000 RTP EX                    Apr 2008


   Fourth Packet: This packet will have a third tile part (tile 2) 1355
   bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | 0 | 0 |  1  |0|       1       |               2               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       0       |                     3033                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF90 000A 0002 0000 054B 0001 FF93    ....                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                 Figure 10: Header Sample 2-4 (4th Packet)

   Fifth Packet: This packet will have a fourth tile part (tile 3) 1290
   bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | 0 | 0 |  1  |0|       1       |               3               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       0       |                     4388                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF90 000A 0003 0000 050A 0001 FF93    ....                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                 Figure 11: Header Sample 2-5 (5th Packet)

A.3.  Sample 3: Packing multiple tiles in single payload,  fragmented
      header. No header compensation, progressive image

   First Packet: This packet will have the first part of the main
   header. 110 bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | 0 | 1 |  0  |1|       0       |               0               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       0       |                       0                       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF4F FF51 002F 0000 ....                                       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+




Leung, et al.           Expires October 26, 2008               [Page 26]

Internet-Draft              JPEG 2000 RTP EX                    Apr 2008


                Figure 12: Header Sample 3-1 (First Packet)

   Second Packet: This packet has the second part of the main header.
   1400 bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | 0 | 2 |  0  |1|       0       |               0               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       0       |                      110                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF64 00FF ....                                                 |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


               Figure 13: Header Sample 3-2 (Second Packet)

   Third Packet: This packet has two tiles, tile 0 and tile 1 1400 bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | 0 | 0 |  0  |1|       1       |               0               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       0       |                     1510                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF90 000A 0000 0000 02BC 0001 FF93 ...                         |
   //                                    .                        //
   |FF90 000A 0001 0000 02BC 0001 FF93 ...                         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                Figure 14: Header Sample 3-3 (Third Packet)

















Leung, et al.           Expires October 26, 2008               [Page 27]

Internet-Draft              JPEG 2000 RTP EX                    Apr 2008


   Fourth Packet: This packet has one tile, tile 2 1395 bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | 0 | 0 |  0  |0|       1       |               2               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       0       |                     2910                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF90 000A 0002 0000 0573 0001 FF93    ....                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                 Figure 15: Header Sample 3-4 (4th Packet)

A.4.  Sample 4: Interlace image, single tile

   The codestream of each image is ordered in LRCP (Layer, Resolution,
   Component, Position) with 1 layer, 3 resolutions, 3 components and 1
   position.

   First packet: This packet will have the whole main header for the odd
   field 210 bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | 1 | 3 |  1  |1|       0       |               0               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       0       |                       0                       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF4F FF51 002F 0000 ....                                       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                Figure 16: Header Sample 4-1 (First Packet)















Leung, et al.           Expires October 26, 2008               [Page 28]

Internet-Draft              JPEG 2000 RTP EX                    Apr 2008


   Second packet: This packet will have the first part of the odd
   field's tile where three jp2-packets are included. 1400 bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | 1 | 0 |  1  |1|       1       |               0               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       0       |                      210                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF90 000A 0000 0000 0578  0001 FF93  ....                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


               Figure 17: Header Sample 4-2 (Second Packet)

   Third packet: This packet will have the second part of the odd
   field's tile 1400 bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | 1 | 0 |  1  |1|       4       |               0               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       0       |                     1610                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |7F04 E708 27D9 D11D 22CB ...                                   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                Figure 18: Header Sample 4-3 (Third Packet)

   Fourth packet: This packet will have the third part of the odd
   field's tile 1300 bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | 1 | 0 |  1  |1|       7       |               0               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       0       |                     3010                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |98BD EC9B 2826 DC62 D4AB ...                                   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                  Figure 19: Header Sample 4 (4th Packet)




Leung, et al.           Expires October 26, 2008               [Page 29]

Internet-Draft              JPEG 2000 RTP EX                    Apr 2008


   Fifth packet: This packet will have the whole main header for the
   even field

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | 2 | 3 |  1  |1|       0       |               0               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       0       |                       0                       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF4F FF51 002F 0000 ....                                       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                  Figure 20: Header Sample 4 (5th Packet)

   Sixth packet: This packet will have the first part of the odd field's
   tile 1400 bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | 2 | 0 |  1  |1|       1       |               0               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       0       |                     1610                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |FF90 000A 0000 0000 0578  0001 FF93  ....                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                  Figure 21: Header Sample 4 (6th Packet)

   Seventh packet: This packet will have the second part of the odd
   field's tile 1400 bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | 2 | 0 |  1  |1|       4       |               0               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       0       |                     3010                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |626C 42F0 166B 6BD0 F8E1 ...                                   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                  Figure 22: Header Sample 4 (7th Packet)




Leung, et al.           Expires October 26, 2008               [Page 30]

Internet-Draft              JPEG 2000 RTP EX                    Apr 2008


   Eighth packet: This packet will have the third part of the odd
   field's tile 1300 bytes

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | 2 | 0 |  1  |1|       7       |               0               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       0       |                     4410                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |8114 41D5 18AB 4A1B ...                                        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                  Figure 23: Header Sample 4 (8th Packet)




































Leung, et al.           Expires October 26, 2008               [Page 31]

Internet-Draft              JPEG 2000 RTP EX                    Apr 2008


Authors' Addresses

   Andrew Leung
   Sony Corporation
   1-7-1 Konan
   Minato-ku
   Tokyo  108-0075
   Japan

   Phone: +81 3 6748-2111
   Email: andrew @ ualberta . net
   URI:   http://www.sony.net/


   Satoshi Futemma
   Sony Corporation
   1-7-1 Konan
   Minato-ku
   Tokyo  108-0075
   Japan

   Phone: +81 3 6748-2111
   Email: satosi-f @ sm . sony . co . jp
   URI:   http://www.sony.net/


   Eisaburo Itakura
   Sony Corporation
   1-7-1 Konan
   Minato-ku
   Tokyo  108-0075
   Japan

   Phone: +81 3 6748-2111
   Email: itakura @ sm . sony . co . jp
   URI:   http://www.sony.net/















Leung, et al.           Expires October 26, 2008               [Page 32]

Internet-Draft              JPEG 2000 RTP EX                    Apr 2008


Full Copyright Statement

   Copyright (C) The IETF Trust (2008).

   This document is subject to the rights, licenses and restrictions
   contained in BCP 78, and except as set forth therein, the authors
   retain all their rights.

   This document and the information contained herein are provided on an
   "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS
   OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND
   THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS
   OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF
   THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED
   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.


Intellectual Property

   The IETF takes no position regarding the validity or scope of any
   Intellectual Property Rights or other rights that might be claimed to
   pertain to the implementation or use of the technology described in
   this document or the extent to which any license under such rights
   might or might not be available; nor does it represent that it has
   made any independent effort to identify any such rights.  Information
   on the procedures with respect to rights in RFC documents can be
   found in BCP 78 and BCP 79.

   Copies of IPR disclosures made to the IETF Secretariat and any
   assurances of licenses to be made available, or the result of an
   attempt made to obtain a general license or permission for the use of
   such proprietary rights by implementers or users of this
   specification can be obtained from the IETF on-line IPR repository at
   http://www.ietf.org/ipr.

   The IETF invites any interested party to bring to its attention any
   copyrights, patents or patent applications, or other proprietary
   rights that may cover technology that may be required to implement
   this standard.  Please address the information to the IETF at
   ietf-ipr@ietf.org.


Acknowledgment

   Funding for the RFC Editor function is provided by the IETF
   Administrative Support Activity (IASA).





Leung, et al.           Expires October 26, 2008               [Page 33]

